app/controllers/surveys_controller.rb

  def index
    if current_user.admin != 0
      @surveys = Survey.order(created_at: :desc)
    else
      @surveys = []
      @alloted = SurveyUser.where(userid: current_user.id)
      if @alloted != nil
        @alloted.each do |alloted|
---
SELECT "surveys".* FROM "surveys"  ORDER BY "surveys"."created_at" DESC
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]