app/controllers/uploads_controller.rb

SELECT "uploads".* FROM "uploads"
---
  def index
    @uploads = Upload.all

SELECT "uploads".* FROM "uploads"
---
  def new
    @upload = Upload.new
    @uploads = Upload.all

INSERT INTO "uploads" ("name", "attachment", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "asd"], ["attachment", "test"], ["created_at", "2015-10-15 01:47:00.174374"], ["updated_at", "2015-10-15 01:47:00.174374"]]
---
  def create
    @upload = Upload.new(upload_params)

    if @upload.save

SELECT  "uploads".* FROM "uploads" WHERE "uploads"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "uploads" WHERE "uploads"."id" = $1  [["id", 2]]
---
  def destroy
    @upload = Upload.find(params[:id])
    @upload.destroy